Repository: Ad2m1109/Coach-Pro---Mobile-Analytics-Platform
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Soccer Analytics
ar: تحليلات كرة القدم

source: General Preferences
ar: التفضيلات العامة

source: Enable Notifications
ar: تفعيل الإشعارات

source: Dark Mode
ar: الوضع الداكن

source: Enable Data Sync
ar: تفعيل مزامنة البيانات

source: Data Management
ar: إدارة البيانات

source: Clear Cache
ar: مسح ذاكرة التخزين المؤقت

source: Export Data
ar: تصدير البيانات

source: Language
ar: اللغة

source: English
ar: الإنجليزية

# french
source: Français
ar: الفرنسية

source: Strategie
ar: الاستراتيجية

source: Logged in as:
ar: تسجيل الدخول باسم:

source: Guest
ar: ضيف

source: Training
ar: التدريب

source: Reunions
ar: الاجتماعات

source: Matches
ar: المباريات

source: All Matches
ar: جميع المباريات

source: Upcoming
ar: القادمة

source: Past
ar: الماضية

source: Filter by Event
ar: التصفية حسب الحدث

source: Error loading events:
ar: خطأ في تحميل الأحداث:

source: No matches found.
ar: لم يتم العثور على مباريات.

# noMatchesInCategory
source: No matches in this category.
ar: لا توجد مباريات في هذه الفئة.

source: Event:
ar: الحدث:

source: Players
ar: اللاعبون

source: Analyze
ar: تحليل

source: Settings
ar: الإعدادات

source: Search settings
ar: البحث في الإعدادات

# teamAndAccount
source: Team & Account
ar: الفريق والحساب

source: Preferences
ar: التفضيلات

source: Manage Events
ar: إدارة الأحداث

source: Advanced Settings
ar: إعدادات متقدمة

source: About
ar: حول

source: Logout
ar: تسجيل الخروج

source: Confirm Logout
ar: تأكيد تسجيل الخروج

source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

source: Add Reunion
ar: إضافة اجتماع

source: Title
ar: العنوان

source: Please enter a title
ar: الرجاء إدخال عنوان

source: Location
ar: الموقع

source: Please enter a location
ar: الرجاء إدخال موقع

# iconNameExample
source: Icon Name (e.g., group_work)
ar: اسم الأيقونة (مثال: group_work)

source: Please enter an icon name
ar: الرجاء إدخال اسم أيقونة

source: Select date
ar: اختر التاريخ

source: Save Reunion
ar: حفظ الاجتماع

source: Reunion created successfully!
ar: تم إنشاء الاجتماع بنجاح!

source: Add Training Session
ar: إضافة حصة تدريبية

# focusExample
source: Focus (e.g., Defense)
ar: التركيز (مثال: الدفاع)

source: Please enter a focus
ar: الرجاء إدخال محور التركيز

# iconNameExampleTraining
source: Icon Name (e.g., sports_soccer)
ar: اسم الأيقونة (مثال: sports_soccer)

source: Save Session
ar: حفظ الحصة

source: Training session created successfully!
ar: تم إنشاء الحصة التدريبية بنجاح!

source: No reunions found.
ar: لم يتم العثور على اجتماعات.

source: No training sessions found.
ar: لم يتم العثور على حصص تدريبية.

source: New Analysis
ar: تحليل جديد

source: History
ar: السجل

source: No analysis history found.
ar: لم يتم العثور على سجل تحليل.

source: No image selected.
ar: لم يتم اختيار أي صورة.

source: Please select an image first.
ar: الرجاء اختيار صورة أولاً.

source: Uploading and analyzing image...
ar: جاري تحميل الصورة وتحليلها...

source: Detection completed successfully!
ar: اكتمل الكشف بنجاح!

source: Image Analysis
ar: تحليل الصور

source: Pick Image
ar: اختر صورة

source: Run Detection
ar: بدء الكشف

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني

source: Password
ar: كلمة المرور

source: Please enter your password
ar: الرجاء إدخال كلمة المرور الخاصة بك

source: Don't have an account? Register here.
ar: ليس لديك حساب؟ سجل هنا.

source: Register
ar: تسجيل

# registrationSuccessful
source: Registration successful! You are now logged in.
ar: تم التسجيل بنجاح! أنت الآن مسجل الدخول.

source: Please enter a valid email address
ar: الرجاء إدخال عنوان بريد إلكتروني صالح

# passwordTooShort
source: Password must be at least 6 characters long
ar: يجب أن لا تقل كلمة المرور عن 6 أحرف

source: Full Name (Optional)
ar: الاسم الكامل (اختياري)

source: Already have an account? Login here.
ar: هل لديك حساب بالفعل؟ سجل الدخول هنا.

source: vs
ar: ضد

source: Save Formation
ar: حفظ التشكيلة

source: No data found.
ar: لم يتم العثور على بيانات.

source: Select Formation
ar: اختر التشكيلة

source: Please select a valid formation.
ar: الرجاء اختيار تشكيلة صالحة.

# pleaseAssign11Players
source: Please assign a player to all 11 positions.
ar: الرجاء تعيين لاعب لجميع المراكز الـ 11.

source: Formation saved successfully!
ar: تم حفظ التشكيلة بنجاح!

source: Match Report
ar: تقرير المباراة

source: Event Timeline
ar: الجدول الزمني للأحداث

source: Lineups
ar: التشكيلات

source: Statistics
ar: الإحصائيات

source: No details found for this match.
ar: لم يتم العثور على تفاصيل لهذه المباراة.

# notAvailable
source: N/A
ar: غير متاح

source: Venue:
ar: الملعب:

source: Unknown
ar: غير معروف

source: Close
ar: إغلاق

source: Minutes Played:
ar: دقائق اللعب:

source: Shots:
ar: التسديدات:

source: Shots on Target:
ar: التسديدات على المرمى:

source: Passes:
ar: التمريرات:

source: Accurate Passes:
ar: التمريرات الدقيقة:

source: Tackles:
ar: التدخلات:

source: Key Passes:
ar: التمريرات المفتاحية:

source: Expected Goals (xG):
ar: الأهداف المتوقعة (xG):

source: Progressive Carries:
ar: الحملات التقدمية:

source: Defensive Coverage:
ar: التغطية الدفاعية:

source: km
ar: كم

source: Rating:
ar: التقييم:

source: Notes:
ar: ملاحظات:

source: No notes available.
ar: لا توجد ملاحظات متاحة.

source: Age
ar: العمر

source: Height
ar: الطول

source: Weight
ar: الوزن

source: Average
ar: المعدل

source: Average: N/A
ar: المعدل: غير متاح

source: Team Comparison
ar: مقارنة الفرق

source: Possession
ar: الاستحواذ

source: Total Shots
ar: إجمالي التسديدات

source: Final 3rd Passes
ar: تمريرات الثلث الأخير

source: Player Performance
ar: أداء اللاعبين

source: Add New Event
ar: إضافة حدث جديد

source: Event Name
ar: اسم الحدث

source: Please enter an event name
ar: الرجاء إدخال اسم الحدث

source: Save Event
ar: حفظ الحدث

source: Event created successfully!
ar: تم إنشاء الحدث بنجاح!

source: Add New Match
ar: إضافة مباراة جديدة

source: Opponent Team Name
ar: اسم الفريق المنافس

source: Please enter opponent team name
ar: الرجاء إدخال اسم الفريق المنافس

source: Time:
ar: الوقت:

source: Select Time
ar: اختر الوقت

source: Home Game
ar: مباراة على أرضنا

source: No events available.
ar: لا توجد أحداث متاحة.

source: Please select an event
ar: الرجاء اختيار حدث

source: Save Match
ar: حفظ المباراة

source: Match created successfully!
ar: تم إنشاء المباراة بنجاح!

source: Search
ar: بحث

source: Sort
ar: فرز

source: Name
ar: الاسم

source: Jersey Number
ar: رقم القميص

source: Market Value
ar: القيمة السوقية

source: Position
ar: المركز

source: No players found.
ar: لم يتم العثور على لاعبين.

source: Add New Player
ar: إضافة لاعب جديد

source: Player Name
ar: اسم اللاعب

# pleaseEnterPlayerName
source: Please enter a player name
ar: الرجاء إدخال اسم اللاعب

source: Birth Date: Select Date
ar: تاريخ الميلاد: اختر التاريخ

source: Birth Date:
ar: تاريخ الميلاد:

source: Dominant Foot
ar: القدم المهيمنة

source: left
ar: يسرى

source: right
ar: يمنى

source: Height (cm)
ar: الطول (سم)

source: Weight (kg)
ar: الوزن (كجم)

source: Image URL
ar: رابط الصورة

source: Save Player
ar: حفظ اللاعب

# noTeamFoundForUser
source: No team found for the current user. Please create a team first.
ar: لم يتم العثور على فريق للمستخدم الحالي. الرجاء إنشاء فريق أولاً.

source: Player created successfully!
ar: تم إنشاء اللاعب بنجاح!

source: Details
ar: التفاصيل

source: Image updated successfully!
ar: تم تحديث الصورة بنجاح!

# noMatchStatsFoundForPlayer
source: No match statistics found for this player.
ar: لم يتم العثور على إحصائيات مباريات لهذا اللاعب.

source: Rating Evolution
ar: تطور التقييم

source: Match History
ar: سجل المباريات

source: Match ID:
ar: معرف المباراة:

source: on target
ar: على المرمى

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

# appDescription
source: Your ultimate companion for analyzing soccer matches, tracking player performance, and strategizing for success.
ar: رفيقك الأمثل لتحليل مباريات كرة القدم، وتتبع أداء اللاعبين، ووضع الاستراتيجيات لتحقيق النجاح.

source: Terms of Service
ar: شروط الخدمة

source: Privacy Policy
ar: سياسة الخصوصية

# copyright
source: © 2025 Soccer Analytics. All rights reserved.
ar: © 2025 Soccer Analytics. جميع الحقوق محفوظة.

# noTeamFoundCreateOne
source: No team found. Please create a team.
ar: لم يتم العثور على فريق. الرجاء إنشاء فريق.

source: Team Name
ar: اسم الفريق

# pleaseEnterTeamName
source: Please enter a team name
ar: الرجاء إدخال اسم الفريق

source: Primary Color
ar: اللون الأساسي

source: Secondary Color
ar: اللون الثانوي

source: Change
ar: تغيير

source: Select a Color
ar: اختر لونًا

source: Select
ar: اختيار

source: Changes saved automatically.
ar: تم حفظ التغييرات تلقائيًا.

source: Account
ar: الحساب

source: User not found
ar: المستخدم غير موجود

# noDataFoundEnsureLoggedIn
source: No data found. Please ensure you are logged in.
ar: لم يتم العثور على بيانات. يرجى التأكد من تسجيل الدخول.

# createTeamToAddLogo
source: Create a team first to add a logo.
ar: أنشئ فريقًا أولاً لإضافة شعار.

source: No team found
ar: لم يتم العثور على فريق

source: Account Settings
ar: إعدادات الحساب

source: Change Password
ar: تغيير كلمة المرور

source: Not logged in
ar: لم يتم تسجيل الدخول

# changePasswordNotImplemented
source: Change password functionality is not yet implemented.
ar: وظيفة تغيير كلمة المرور لم تنفذ بعد.

source: Confirm Deletion
ar: تأكيد الحذف

source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: Delete
ar: حذف

source: Event deleted successfully!
ar: تم حذف الحدث بنجاح!

source: Team Settings
ar: إعدادات الفريق

source: Select Team
ar: اختر الفريق

# primaryColorHex
source: Primary Color (Hex e.g., #FF0000)
ar: اللون الأساسي (Hex e.g., #FF0000)

# pleaseEnterPrimaryColor
source: Please enter a primary color
ar: الرجاء إدخال لون أساسي

# enterValidHexColor
source: Enter a valid hex color (e.g., #FF0000)
ar: أدخل لون hex صالح (e.g., #FF0000)

# secondaryColorHex
source: Secondary Color (Hex e.g., #0000FF)
ar: اللون الثانوي (Hex e.g., #0000FF)

source: Logo URL
ar: رابط الشعار

# enterValidUrl
source: Enter a valid URL
ar: أدخل رابطًا صالحًا

source: Create Team
ar: إنشاء فريق

source: Save Changes
ar: حفظ التغييرات

source: Team created successfully!
ar: تم إنشاء الفريق بنجاح!

# teamUpdateNotImplemented
source: Team update not yet implemented in API.
ar: تحديث الفريق لم يتم تنفيذه بعد في الواجهة الخلفية.

# failedToSaveFormation
source: Failed to save formation: {error}
ar: فشل حفظ التشكيلة: {error}

# errorWithMessage
source: Error: {message}
ar: خطأ: {message}

# registrationFailed
source: Registration failed: {message}
ar: فشل التسجيل: {message}

# anUnexpectedErrorOccurredWithMessage
source: An unexpected error occurred: {error}
ar: حدث خطأ غير متوقع: {error}

# imageSelected
source: Image selected: {name}
ar: تم اختيار الصورة: {name}

# detectionCompleteResponse
source: Detection complete! Response: {responseBody}
ar: اكتمل الكشف! الاستجابة: {responseBody}

# detectionFailedWithCode
source: Detection failed: {statusCode} - {errorBody}
ar: فشل الكشف: {statusCode} - {errorBody}

# detectionFailed
source: Detection failed: {statusCode}
ar: فشل الكشف: {statusCode}

# errorDuringDetection
source: Error during detection: {error}
ar: خطأ أثناء الكشف: {error}

# selected
source: Selected: {name}
ar: المحدد: {name}

# failedToCreateMatch
source: Failed to create match: {error}
ar: فشل إنشاء المباراة: {error}

# date
source: Date: {date}
ar: التاريخ: {date}

# failedToCreateEvent
source: Failed to create event: {error}
ar: فشل إنشاء الحدث: {error}

# failedToGetUserTeam
source: Failed to get user team: {error}
ar: فشل الحصول على فريق المستخدم: {error}

# failedToCreatePlayer
source: Failed to create player: {error}
ar: فشل إنشاء اللاعب: {error}

# failedToUploadImage
source: Failed to upload image: {error}
ar: فشل تحميل الصورة: {error}

source: Logo updated successfully!
ar: تم تحديث الشعار بنجاح!

# failedToUploadLogo
source: Failed to upload logo: {error}
ar: فشل تحميل الشعار: {error}

# failedToSaveChanges
source: Failed to save changes: {error}
ar: فشل حفظ التغييرات: {error}

# confirmDeleteEvent
source: Are you sure you want to delete the event "{eventName}"
ar: هل أنت متأكد أنك تريد حذف الحدث "{eventName}"؟

# failedToDeleteEvent
source: Failed to delete event: {error}
ar: فشل حذف الحدث: {error}

# failedToCreateReunion
source: Failed to create reunion: {error}
ar: فشل إنشاء الاجتماع: {error}

# failedToCreateSession
source: Failed to create session: {error}
ar: فشل إنشاء الحصة: {error}

source: Pressures
ar: الضغوط

source: No events found.
ar: لم يتم العثور على أحداث.

source: Nationality
ar: الجنسية
